#ifndef _drx_RuCore_rumath_h_
#define _drx_RuCore_rumath_h_

#include <drxtypes.h>

extern "C"{
	
//Получить абсолютное значение числа.
    ц32     абс(ц32 j);
                      // abs(j)
    ц64    абс64(ц64  j);
                    // labs(j)
    ц64_2    абсд(ц64_2 j);
                   // llabs(j)
                   
//Найти кубический корень числа.
    дво  кубкор(дво x);
                     // cbrt(x)
    плав   кубкорп(плав x);
                     // cbrtf(x)
    реал    кубкорр(реал x);
                     // cbrtl(x)

//..................
    дво  фабс(дво x);
                     // fabs(x)
    плав   фабсп(плав x);
                     // fabsf(x)
    реал    фабср(реал x);
                     // fabsl(x)
                     
//Вычислить гипотенуза двух катетов.
    дво  гипот(дво x, дво y);
                     // hypot(x, y)
    плав   гипотп(плав x, плав y);
                     // hypotf(x, y)
    реал    гипотр(реал x, реал y);
                     // hypotl(x, y)

//Возвести первое число в степень, указанную вторым аргументом.
    дво  степ(дво x, дво y);
                     // pow(x, y)
    плав   степп(плав x, плав y);
                     // powf(x, y)
    реал    степр(реал x, реал y);
                     // powl(x, y)

//Извлечь квадратный корень числа.
    дво  квкор(дво x);
                     // sqrt(x)
    плав   квкорп(плав x);
                     // sqrtf(x)
    реал    квкорр(реал x);
                     // sqrtl(x)

//.................
    дво  фцош(дво x);
                     // erf(x)
    плав   фцошп(плав x);
                     // erff(x)
    реал    фцошр(реал x);
                     // erfl(x)
                     
//....................
    дво  фцошк(дво x);
                     // erfc(x)
    плав   фцошкп(плав x);
                     // erfcf(x)
    реал    фцошкр(реал x);
                     // erfcl(x)
                     
//....................
    дво  лгамма(дво x);
                     // lgamma(x)
    плав   лгаммап(плав x);
                     // lgammaf(x)
    реал    лгаммар(реал x);
                     // lgammal(x)
                     
//....................
    дво  тгамма(дво x);
                     // tgamma(x)
    плав   тгаммап(плав x);
                     // tgammaf(x)
    реал   тгаммар(реал x);
                     // tgammal(x)
                     
// Округлить вверх.
    дво  вокругли(дво x);
                     // ceil(x)
    плав   вокруглип(плав x);
                     // ceilf(x)
    реал    вокруглир(реал x);
                     // ceill(x)
                     
// Округлить вниз.
    дво  нокругли(дво x);
                     // floor(x)
    плав   нокруглип(плав x);
                     // floorf(x)
    реал    нокруглир(реал x);
                     // floorl(x)
                     
// Найти ближайшее целое для дроби.
    дво  ближцел(дво x);
                     // nearbyint(x)
    плав   ближцелп(плав x);
                     // nearbyintf(x)
    реал    ближцелр(реал x);
                     // nearbyintl(x)

//......................
    дво  ринт(дво x);
                     // rint(x)
    плав   ринтп(плав x);
                     // rintf(x)
    реал    ринтр(реал x);
                     // rintl(x)
                     
// Простое округление.
    дво  округли(дво x);
                     // std::round(x)
    плав   округлип(плав x);
                     // std::roundf(x)
    реал    округлир(реал x);
                     // std::roundl(x)

// Обрезать дробную часть.
    дво  транк(дво x);
                     // trunc(x)
    плав   транкп(плав x);
                     // truncf(x)
    реал    транкр(реал x);
                     // truncl(x)

//.................
    дво  фмод(дво x, дво y);
                     // fmod(x, y)
    плав   фмодп(плав x, плав y);
                     // fmodf(x, y)
    реал    фмодр(реал x, реал y);
                     // fmodl(x, y)
                     
//
    дво  скалбн(дво x, цел n);
                      // scalbn(x, n)
    плав   скалбнп(плав x, цел n);
                     //scalbnf(x, n)
    реал    скалбнр(реал x, цел n);
                      //scalbnl(x, n)
                     
//Получить остаток от деления первого на второе.
    дво  остаток(дво x, дво y);
                     // remainder(x, y)
    плав   остатокп(плав x, плав y);
                     // remainderf(x, y)
    реал    остатокр(реал x, реал y);
                     // remainderl(x, y)

//...........................
    дво  ремкво(дво x, дво y, ц32* quo);
                     // remquo(x, y, quo)
    плав   ремквоп(плав x, плав y, ц32* quo);
                     // remquof(x, y, quo)
    реал    ремквор(реал x, реал y, ц32* quo);
                     // remquol(x, y, quo)
                     
//Копировать знак первому у второго (или наоборот?)
    дво  копируйзнак(дво x, дво y);
                     // copysign(x, y)
    плав   копируйзнакп(плав x, плав y);
                     // copysignf(x, y)
    реал    копируйзнакр(реал x, реал y);
                     // copysignl(x, y)

//............
    дво  нечисло(ткст tangp);
                     // nan(tangp)
    плав   нечислоп(ткст tangp);
                     // nanf(tangp)
    реал    нечислор(ткст tangp);
                     // nanl(tangp)
//................
    дво  следза(дво x, дво y);
                     // nextafter(x, y)
    плав   следзап(плав x, плав y);
                     // nextafterf(x, y)
    реал    следзар(реал x, реал y);
                     // nextafterl(x, y)
//..............
    дво  следк(дво x, реал y);
                     // nexttoward(x, y)
    плав   следкп(плав x, реал y);
                     // nexttowardf(x, y)
    реал    следкд(реал x, реал y);
                     // nexttowardl(x, y)
    
    }
#endif
